## Global Historical Climatology Network Dataset
Variables are stored in both rows and columns
This dataset represents the daily weather records for a weather station (MX17004) in Mexico for five months in 2010.

In [2]:
import pandas as pd
import numpy as np
import datetime

In [3]:
df = pd.read_csv('../weather-raw.csv')

In [7]:
df=df[df['month']<=5]

In [10]:
df.head()

,id,year,month,element,d1,d2,d3,d4,d5,d6,...,d22,d23,d24,d25,d26,d27,d28,d29,d30,d31
0,MX17004,2010,1,tmax,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,27.8,NaN
1,MX17004,2010,1,tmin,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,14.5,NaN
2,MX17004,2010,2,tmax,NaN,27.3,24.1,NaN,NaN,NaN,...,NaN,29.9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,MX17004,2010,2,tmin,NaN,14.4,14.4,NaN,NaN,NaN,...,NaN,10.7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,MX17004,2010,3,tmax,NaN,NaN,NaN,NaN,32.1,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [11]:
#Transform column names for days in numbers
day_number = df.columns.str.extract("d(\d+)", expand=False)
day_number=list(day_number.dropna())

In [12]:
print(day_number)

['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30', '31']

In [13]:
# Add the 4 first columns names to the list
day_number[0:0]=['id','year','month','element']

In [14]:
# Replace column names if the df 
df.columns=day_number

In [15]:
df.columns

Index(['id', 'year', 'month', 'element', '1', '2', '3', '4', '5', '6', '7',
       '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19',
       '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30', '31'],
      dtype='object')

In [16]:
# Melt dataframe to get temperature by date and month
df_2 = pd.melt(df, id_vars=["id","year", "month","element"], 
                  var_name="day", value_name="Temp")

In [17]:
df_2.head()

        id  year  month element day  Temp
0  MX17004  2010      1    tmax   1   NaN
1  MX17004  2010      1    tmin   1   NaN
2  MX17004  2010      2    tmax   1   NaN
3  MX17004  2010      2    tmin   1   NaN
4  MX17004  2010      3    tmax   1   NaN

In [18]:
#Create a date column
df_2['date'] = pd.to_datetime(df_2[['year', 'month', 'day']],errors='coerce')

In [19]:
#Drop year,month and day columns
df_2 = df_2.drop(['year',"month","day"], axis=1)

In [20]:
df_2.head()

        id element  Temp       date
0  MX17004    tmax   NaN 2010-01-01
1  MX17004    tmin   NaN 2010-01-01
2  MX17004    tmax   NaN 2010-02-01
3  MX17004    tmin   NaN 2010-02-01
4  MX17004    tmax   NaN 2010-03-01

In [21]:
# Unmelting column "element" to get two columns , tmax and tmin
df_2 = df_2.pivot_table(index=["id","date"], columns="element", values="Temp")

In [22]:
df_2.head()

element             tmax  tmin
id      date
MX17004 2010-01-01   NaN   NaN
        2010-01-02   NaN   NaN
        2010-01-03   NaN   NaN
        2010-01-04   NaN   NaN
        2010-01-05   NaN   NaN

In [23]:
df_2.reset_index(drop=False,inplace=True)

In [24]:
df_2.head()

element       id       date  tmax  tmin
0        MX17004 2010-01-01   NaN   NaN
1        MX17004 2010-01-02   NaN   NaN
2        MX17004 2010-01-03   NaN   NaN
3        MX17004 2010-01-04   NaN   NaN
4        MX17004 2010-01-05   NaN   NaN